app/controllers/tickets_controller.rb

  def index
    @tickets = Ticket.all
---
SELECT "tickets".* FROM "tickets"

  def show
   @excavators = Excavator.where(ticket_id: params[:id])
---
SELECT "excavators".* FROM "excavators" WHERE "excavators"."ticket_id" = $1  [["ticket_id", 1]]