app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("RequestNumber", "SequenceNumber", "RequestType", "DateTimes", "ServiceArea", "DigsiteInfo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "excavators" ("Excavator", "ticket_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    ticket = Ticket.new(tickets_params)
    if ticket.save
       excavator = ticket.excavators.new(excavator_params)
       if excavator.save